# Sample Snippet: MoveLRMiddleBasisOfLink

Source project: `existingCodes\品成插件源代码\机电\MoveLRMiddleBasisOfLink\MoveLRMiddleBasisOfLink`

This is a compact reference excerpt generated from existing plug-ins. It preserves the command structure and key API usage without requiring the full `existingCodes/` tree during normal skill use.

## Command.cs

```csharp
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

using Autodesk.Revit.UI;
using Autodesk.Revit.DB;
using Autodesk.Revit.UI.Selection;
using Autodesk.Revit.Attributes;
using System.Collections;
using System.Diagnostics;
using System.Windows.Forms;
using System.IO;

namespace MoveLRMiddleBasisOfLink
{
    [Transaction(TransactionMode.Manual)]
    public class Command : IExternalCommand
    {
        public static double distance = 100;
        public Result Execute(ExternalCommandData commandData, ref string message, ElementSet elements)
        {
            #region 判断加密

            //注册验证
            string licFile = string.Format("{0}\\Key.lic",
    System.IO.Path.GetDirectoryName(System.Reflection.Assembly.GetExecutingAssembly().Location));
            if (!BTAddInHelper.Utils.CheckReg(licFile))
            {
                return Result.Cancelled;
            }

            #endregion
            UIApplication uiapp = commandData.Application;
            Document doc = uiapp.ActiveUIDocument.Document;
            Selection sel = uiapp.ActiveUIDocument.Selection;

            try
            {
                while (true)
                {
                    //选择第一个构件（链接的墙）
                    Reference firstPick = sel.PickObject(ObjectType.LinkedElement);
                    RevitLinkInstance linkIns = doc.GetElement(firstPick) as RevitLinkInstance;
                    Element firstEle = linkIns.GetLinkDocument().GetElement(firstPick.LinkedElementId);
                    bool b1 = YorNWall(firstEle);
                    if (b1 == false)
                    {
                        TaskDialog.Show("警告", "选择的不是墙");
                    }
                    else
                    {
                        //选择第二个构件（机电管线）
                        Reference secondPick = sel.PickObject(ObjectType.Element, new MEPCurveSelectionFilter());
                        Element secondEle = doc.GetElement(secondPick);

                            //得到构件上的点
                            LocationCurve locationCurve1 = firstEle.Location as LocationCurve;
                            XYZ firstDir = (locationCurve1.Curve as Line).Direction;
                            XYZ firstPo = locationCurve1.Curve.GetEndPoint(0);
                            XYZ firstPo1 = locationCurve1.Curve.GetEndPoint(1);
                            LocationCurve locationCurve2 = secondEle.Location as LocationCurve;
                            XYZ secondDir = (locationCurve2.Curve as Line).Direction;
                            XYZ secondPo = locationCurve2.Curve.GetEndPoint(0);

                            XYZ newLocation = new XYZ();
                            List<double> firstList = new List<double>();
                            //判断构件是否平行
                            if (!firstDir.IsAlmostEqualTo(secondDir, 1.5))
                            {
                                TaskDialog.Show("警告", "所选构件不平行");
                            }
                            else  //平行，进入程序
                            {
                                //弹出对话框，输入希望移动第二个构件后，两个构件的最后距离
                                using (SettingForm form = new SettingForm())
                                {
                                    if (form.ShowDialog() != DialogResult.OK)
                                    {
                                        return Result.Failed;
                                    }
                                }
                                XYZ pLine = GetProjectivePoint(firstPo, firstPo1, secondPo);
                                double w1 = GetHalfWidth(firstEle);
                                //double w2 = GetHalfWidth(secondEle);
                                //double w = (w1 + w2) / 304.8;
                                double dAB = pLine.DistanceTo(secondPo);
                                double dAC;
                                if (distance > 0)
// ... truncated ...
```

## Utils.cs

```csharp
using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Net;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace MoveLRMiddleBasisOfLink
{
    class Utils
    {
        #region 获得硬盘序列号
        [System.Runtime.InteropServices.DllImport("kernel32.dll")]
        private static extern long GetVolumeInformation(
            string PathName,
            StringBuilder VolumeNameBuffer,
            UInt32 VolumeNameSize,
            ref UInt32 VolumeSerialNumber,
            ref UInt32 MaximumComponentLength,
            ref UInt32 FileSystemFlags,
            StringBuilder FileSystemNameBuffer,
            UInt32 FileSystemNameSize);

        public static string GetVolumeSerial(string strDriveLetter)
        {
            uint serNum = 0;
            uint maxCompLen = 0;
            StringBuilder VolLabel = new StringBuilder(256); // Label
            UInt32 VolFlags = new UInt32();
            StringBuilder FSName = new StringBuilder(256); // File System Name
            strDriveLetter += "://"; // fix up the passed-in drive letter for the API call
            long Ret = GetVolumeInformation(strDriveLetter, VolLabel, (UInt32)VolLabel.Capacity, ref serNum, ref maxCompLen, ref VolFlags, FSName, (UInt32)FSName.Capacity);
            return Convert.ToString(serNum);
        }
        #endregion

        #region 给一个字符串进行MD5加密
        /// <summary>
        /// 给一个字符串进行MD5加密
        /// </summary>
        /// <param name="strText">待加密字符串</param>
        /// <returns>加密后的字符串</returns>
        public static string MD5Encrypt(string strText)
        {
            char[] md5Chars = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'a', 'b', 'c', 'd', 'e', 'f' };
            System.Security.Cryptography.MD5 md5 = new System.Security.Cryptography.MD5CryptoServiceProvider();
            byte[] result = md5.ComputeHash(System.Text.Encoding.UTF8.GetBytes(strText));
            char[] chars = new char[result.Length * 2];
            int i = 0;
            foreach (byte b in result)
            {
                char c0 = md5Chars[(b & 0xf0) >> 4];
                chars[i++] = c0;
                char c1 = md5Chars[b & 0xf];
                chars[i++] = c1;
            }
            return new String(chars);
        }
        #endregion

        #region 验证注册
        /// <summary>
        /// 验证注册
        /// </summary>
        /// <returns></returns>
        public static bool AddInCheckIn()
        {
            var assemblyPath = System.Reflection.Assembly.GetExecutingAssembly().Location;
            var path = Path.Combine(Path.GetDirectoryName(assemblyPath), "BimtransToolReg.log");
            if (!File.Exists(path))
            {
                MessageBox.Show("插件未注册！请联系福建品成建设工程顾问有限公司，电话：0591-87310215");
                return false;
            }
            var regData = File.ReadAllLines(path);
            if (regData.Length != 2)
            {
                MessageBox.Show("注册信息错误，请重新注册！请联系福建品成建设工程顾问有限公司，电话：0591-87310215");
                return false;
            }
            var seriesNum = regData[0];
            var localKey = regData[1];
            var diskNum = GetVolumeSerial("C");
            var generateKey = MD5Encrypt(seriesNum + diskNum);
            if (generateKey != localKey)
            {
                MessageBox.Show("注册信息错误，请重新注册！请联系福建品成建设工程顾问有限公司，电话：0591-87310215");
                return false;
// ... truncated ...
```